       IDENTIFICATION DIVISION.
       PROGRAM-ID. PROJETO6.
       AUTHOR. CAIO FELIPE.  
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT ARQ-CLI ASSIGN TO "OUTPUT/CLIENTES_ORD.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-TRX ASSIGN TO "OUTPUT/TRANSACOES_ORD.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-REL ASSIGN TO "OUTPUT/RELATORIO.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-DET ASSIGN TO "OUTPUT/DETALHADO.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-ERR ASSIGN TO "OUTPUT/ERROS.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-LOG ASSIGN TO "OUTPUT/LOG.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-DB2-REQ ASSIGN TO "OUTPUT/DB2_REQUEST.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

           SELECT ARQ-DB2-RESP ASSIGN TO "OUTPUT/DB2_RESPONSE.txt"
              ORGANIZATION IS LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       COPY REGCLI6.
       COPY REGTRX6.
       COPY REGOUT6.

       WORKING-STORAGE SECTION.
       01  WS-VARIAVEIS.
           COPY WRKP6.

       PROCEDURE DIVISION.

       0000-PRINCIPAL.
           PERFORM 0100-INICIAR.
           PERFORM 0200-PROCESSAR-CLIENTES.
           PERFORM 0300-PROCESSAR-TRANSACOES.
           PERFORM 0900-FINALIZAR.
           STOP RUN.

       COPY DBP6.
       COPY ROTP6.