       FD  ARQ-REL.
       01  REG-RELATORIO          PIC X(132).

       FD  ARQ-DET.
       01  REG-DETALHADO          PIC X(132).

       FD  ARQ-ERR.
       01  REG-ERRO               PIC X(132).

       FD  ARQ-LOG.
       01  REG-LOG                PIC X(132).

       FD  ARQ-DB2-REQ.
       01  REG-DB2-REQ            PIC X(500).

       FD  ARQ-DB2-RESP.
       01  REG-DB2-RESP           PIC X(500).